# SALES PROJECT - DB . SQL

# Creating DataBase and Preprocessing

In [1]:
%load_ext sql
%sql sqlite:///sales.db

## Creating Tables and Inserting Data

### Table 1 : Customers (customer_id, name, gender, age, city)

In [2]:
%%sql

-- Drop tables if exist
DROP TABLE IF EXISTS Customers;

-- Create Customers table
CREATE TABLE Customers (
    customer_id INTEGER PRIMARY KEY,
    name TEXT,
    gender TEXT,
    age INTEGER,
    city TEXT
);

 * sqlite:///sales.db
Done.
Done.

[]

In [3]:
%%sql

-- Insert Customers (20+ records, some with missing age or city)
INSERT INTO Customers (name, gender, age, city) VALUES
('John Smith', 'M', 28, 'New York'),
('Emma Johnson', 'F', 34, 'Los Angeles'),
('Michael Brown', 'M', 22, 'Chicago'),
('Olivia Davis', 'F', 45, 'Houston'),
('William Wilson', 'M', NULL, 'Phoenix'), -- missing age
('Sophia Martinez', 'F', 29, NULL),        -- missing city
('James Anderson', 'M', 31, 'Philadelphia'),
('Isabella Thomas', 'F', 27, 'San Antonio'),
('Benjamin Jackson', 'M', 40, 'San Diego'),
('Mia White', 'F', 35, 'Dallas'),
('Elijah Harris', 'M', 26, 'San Jose'),
('Charlotte Martin', 'F', 33, 'Austin'),
('Alexander Thompson', 'M', 38, 'Jacksonville'),
('Amelia Garcia', 'F', 24, 'Fort Worth'),
('Daniel Martinez', 'M', 30, 'Columbus'),
('Harper Robinson', 'F', 29, 'Charlotte'),
('Matthew Clark', 'M', NULL, NULL),         -- missing age and city
('Evelyn Rodriguez', 'F', 42, 'San Francisco'),
('Joseph Lewis', 'M', 37, 'Indianapolis'),
('Kevin Garvy', 'M', 45, 'Austin'),
('Jill Garvy', 'F', 19, 'New York'),
('James Potter', 'M', 40, 'Phoenix'),
('Lily Potter', 'F', NULL, 'Phoenix'),
('Laurel Gomez', 'F', 32, 'Los Angeles'),
('Frank Diaz', 'M', NULL, 'Phoenix'),
('Rafael Nadal', 'M', 39, 'San Jose'),
('Roger Federer', 'M', 41, 'Los Angeles'),
('Alexander Zverev', 'M', 26, 'Los Angeles'),
('Stephen Salvatore', 'M', NULL, 'Virginia'),
('Damon Salvatore', 'M', NULL, 'Virginia'),
('Elena Gilbert', 'F', NULL, 'Virginia'),
('Caroline Forbes', 'F', NULL, 'Virginia'),
('Abigail Lee', 'F', 32, 'Seattle'),
('Adam Adams', 'M', 34, 'Los Angeles');

 * sqlite:///sales.db
Done.

[]

### Table 2 : Products (product_id, product_name, category, price)

In [4]:
%%sql

-- Drop tables if exist
DROP TABLE IF EXISTS Products;

-- Create Products table
CREATE TABLE Products (
    product_id INTEGER PRIMARY KEY,
    product_name TEXT,
    category TEXT,
    price REAL
);

 * sqlite:///sales.db
Done.
Done.

[]

In [5]:
%%sql

-- Insert Products (30 records, some with zero or negative prices)
INSERT INTO Products (product_name, category, price) VALUES
('Laptop Dell XPS', 'Electronics', 1200),
('Smartphone iPhone', 'Electronics', 999),
('Bluetooth Headphones', 'Electronics', 150),
('Office Chair', 'Furniture', 300),
('LED Desk Lamp', 'Furniture', 45),
('Coffee Maker', 'Appliances', 80),
('Electric Kettle', 'Appliances', 35),
('Smartwatch Samsung', 'Electronics', 200),
('Yoga Mat', 'Sports', 25),
('Mountain Bike', 'Sports', 700),
('Tennis Racket', 'Sports', 120),
('Water Bottle', 'Sports', 10),
('Cookware Set', 'Kitchen', 150),
('Knife Set', 'Kitchen', 90),
('Microwave Oven', 'Appliances', 250),
('Vacuum Cleaner', 'Appliances', 180),
('Dining Table', 'Furniture', 600),
('Bookshelf', 'Furniture', 120),
('Gaming Console', 'Electronics', 400),
('USB Flash Drive 64GB', 'Electronics', 20),
('Wireless Mouse', 'Electronics', 25),
('Keyboard Mechanical', 'Electronics', 75),
('Refrigerator', 'Appliances', 0),         -- price zero, needs fix
('Dishwasher', 'Appliances', -150),        -- negative price, needs fix
('Air Conditioner', 'Appliances', 350),
('Hair Dryer', 'Appliances', 40),
('Running Shoes', 'Sports', 85),
('Smart TV', 'Electronics', 900),
('Tablet iPad', 'Electronics', 400),
('Knife', 'Kitchen', 25),
('Airpods', 'Electronics', 200),
('Blender', 'Kitchen', 60);

 * sqlite:///sales.db
Done.

[]

### Table 3 : Orders (order_id, customer_id, order_date)

In [6]:
%%sql

-- Drop tables if exist
DROP TABLE IF EXISTS Orders;

-- Create Orders table
CREATE TABLE Orders (
    order_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    order_date TEXT,
    FOREIGN KEY(customer_id) REFERENCES Customers(customer_id)
);

 * sqlite:///sales.db
Done.
Done.

[]

In [7]:
%%sql

-- Insert Orders (100 records, some with invalid or missing dates)
INSERT INTO Orders (customer_id, order_date) VALUES
(1, '2024-02-15'),
(2, '2024-02-18'),
(3, '2024-03-10'),
(4, '2024-01-20'),
(5, NULL),             -- missing date
(6, '2024-05-12'),
(7, 'invalid-date'),   -- invalid date
(8, '2024-06-02'),
(9, '2024-04-15'),
(10, '2024-03-22'),
(11, '2024-05-30'),
(12, '2024-01-08'),
(13, '2024-02-25'),
(14, '2024-06-15'),
(15, '2024-04-10'),
(16, '2024-03-05'),
(17, '2024-02-11'),
(18, '2024-01-15'),
(19, '2024-06-07'),
(20, '2024-05-01'),
(1, '2024-02-28'),
(2, '2024-04-01'),
(3, '2024-04-15'),
(4, '2024-05-10'),
(5, '2024-05-25'),
(6, '2024-06-01'),
(7, '2024-06-05'),
(8, '2024-06-10'),
(9, '2024-06-15'),
(10, '2024-06-20'),
(11, NULL),               -- missing date
(12, '2024-02-10'),
(13, '2024-03-12'),
(14, '2024-04-22'),
(15, '2024-05-30'),
(16, '2024-06-01'),
(17, 'invalid-date'),     -- invalid date
(18, '2024-06-15'),
(19, '2024-06-20'),
(20, '2024-06-25'),
(1, '2024-03-05'),
(2, '2024-03-15'),
(3, '2024-04-01'),
(4, '2024-04-10'),
(5, '2024-04-15'),
(6, '2024-04-20'),
(7, '2024-05-01'),
(8, '2024-05-05'),
(9, '2024-05-10'),
(10, '2024-05-15'),
(11, '2024-05-20'),
(12, '2024-05-25'),
(13, NULL),               -- missing date
(14, '2024-06-01'),
(15, 'invalid-date'),     -- invalid date
(16, '2024-06-10'),
(17, '2024-06-15'),
(18, '2024-06-20'),
(19, '2024-06-25'),
(20, '2024-06-30'),
(1, '2024-01-10'),
(2, '2024-01-15'),
(3, '2024-01-20'),
(4, '2024-01-25'),
(5, '2024-01-30'),
(6, '2024-02-05'),
(7, '2024-02-10'),
(8, '2024-02-15'),
(9, '2024-02-20'),
(10, '2024-02-25'),
(11, '2024-03-01'),
(12, '2024-03-10'),
(13, '2024-03-15'),
(14, '2024-03-20'),
(15, '2024-03-25'),
(16, '2024-03-30'),
(17, '2024-04-05'),
(18, '2024-04-10'),
(19, '2024-04-15'),
(20, '2024-04-20'),
(1, '2024-04-25'),
(2, '2024-05-01'),
(3, '2024-05-05'),
(4, '2024-05-10'),
(5, '2024-05-15'),
(6, '2024-05-20'),
(7, '2024-05-25'),
(8, '2024-05-30'),
(9, '2024-06-01'),
(10, '2024-06-05'),
(11, '2024-12-05'),
(12, '2024-11-10'),
(13, '2024-12-15'),
(14, '2024-10-20'),
(15, '2024-09-25'),
(16, '2024-08-30'),
(17, '2024-07-05'),
(18, '2024-08-10'),
(19, '2024-09-15'),
(20, '2024-10-20'),
(21, '2024-01-25'),
(22, '2024-09-26'),
(23, '2024-01-27'),
(24, '2024-05-28'),
(25, '2024-04-29'),
(26, '2024-03-02'),
(27, '2024-11-20'),
(28, '2024-10-03'),
(29, '2024-08-30'),
(30, '2024-07-29'),
(31, '2024-11-06'),
(32, '2024-12-08'),
(33, '2024-12-09'),
(32, '2024-12-10'),
(31, '2024-02-25'),
(30, '2024-01-28'),
(29, '2024-03-20'),
(28, '2024-04-20'),
(27, '2024-05-29'),
(26, '2024-06-14'),
(30, '2024-04-15'),
(31, '2024-04-16'),
(25, '2024-08-20'),
(22, '2024-01-15'),
(34, '2024-07-21'),
(34, '2024-07-19'),
(33, '2024-10-09'),
(34, '2024-09-29'),
(32, '2024-11-09'),
(34, '2024-07-09');

 * sqlite:///sales.db
Done.

[]

### Table 4 : OrderDetails (order_detail_id, order_id, product_id, quantity)

In [8]:
%%sql

-- Drop tables if exist
DROP TABLE IF EXISTS OrderDetails;

-- Create OrderDetails table
CREATE TABLE OrderDetails (
    order_detail_id INTEGER PRIMARY KEY,
    order_id INTEGER,
    product_id INTEGER,
    quantity INTEGER,
    FOREIGN KEY(order_id) REFERENCES Orders(order_id),
    FOREIGN KEY(product_id) REFERENCES Products(product_id)
);

 * sqlite:///sales.db
Done.
Done.

[]

In [10]:
%%sql

-- Insert OrderDetails (several entries per order, quantity varies)
INSERT INTO OrderDetails (order_id, product_id, quantity) VALUES
(1, 1, 1),
(1, 3, 2),
(2, 5, 1),
(2, 6, 1),
(3, 2, 1),
(3, 10, 1),
(4, 4, 2),
(5, 7, 6),
(6, 8, 3),
(7, 9, 1),
(8, 11, 2),
(9, 12, 1),
(10, 13, 1),
(21, 1, 1),
(21, 4, 2),
(22, 2, 1),
(22, 3, 1),
(23, 5, 6),
(23, 6, 1),
(24, 7, 2),
(25, 8, 1),
(26, 9, 1),
(27, 10, 3),
(28, 11, 2),
(29, 12, 1),
(30, 13, 1),
(31, 14, 2),
(32, 15, 6),
(33, 16, 1),
(34, 17, 3),
(35, 18, 2),
(36, 19, 1),
(37, 20, 1),
(38, 21, 7),
(39, 22, 2),
(40, 23, 1),
(41, 24, 1),
(42, 25, 3),
(43, 26, 1),
(44, 27, 2),
(45, 28, 1),
(46, 29, 1),
(47, 30, 1),
(48, 1, 2),
(49, 2, 1),
(50, 3, 1),
(51, 4, 5),
(52, 5, 2),
(53, 6, 1),
(54, 7, 3),
(55, 8, 1),
(56, 9, 1),
(57, 10, 2),
(58, 11, 1),
(59, 12, 1),
(60, 13, 3),
(61, 14, 1),
(62, 15, 2),
(63, 16, 1),
(64, 17, 4),
(65, 18, 1),
(66, 19, 2),
(67, 20, 1),
(68, 21, 1),
(69, 22, 1),
(70, 23, 2),
(71, 24, 5),
(72, 25, 3),
(73, 26, 1),
(74, 27, 2),
(75, 28, 1),
(76, 29, 1),
(77, 30, 1),
(78, 1, 2),
(79, 2, 1),
(80, 3, 1),
(81, 4, 2),
(82, 5, 1),
(83, 6, 3),
(84, 7, 1),
(85, 8, 2),
(86, 9, 1),
(87, 10, 1),
(88, 11, 2),
(88, 31, 2),
(88, 28, 1),
(89, 12, 1),
(90, 13, 1),
(91, 14, 3),
(92, 15, 2),
(93, 16, 5),
(94, 17, 1),
(95, 18, 1),
(96, 19, 2),
(97, 20, 1),
(98, 21, 1),
(98, 1, 1),
(98, 3, 1),
(98, 31, 1),
(99, 22, 1),
(100, 23, 2),
(101, 23, 1),
(102, 23, 3),
(103, 23, 2),
(104, 23, 1),
(104, 12, 4),
(104, 14, 1),
(104, 25, 1),
(104, 28, 2),
(105, 23, 1),
(106, 24, 1),
(107, 25, 3),
(108, 26, 2),
(109, 27, 4),
(109, 13, 3),
(109, 4, 2),
(109, 14, 1),
(110, 28, 2),
(111, 29, 1),
(112, 30, 1),
(113, 31, 1),
(114, 32, 5),
(115, 33, 2),
(115, 31, 2),
(115, 3, 2),
(115, 13, 1),
(116, 32, 1),
(117, 31, 6),
(118, 30, 1),
(119, 30, 2),
(120, 28, 1),
(121, 27, 4),
(122, 26, 2),
(123, 25, 3),
(124, 25, 1),
(124, 21, 1),
(124, 22, 1),
(124, 23, 1),
(124, 24, 1),
(125, 24, 1),
(126, 31, 5),
(127, 30, 4),
(128, 29, 5),
(129, 28, 3),
(130, 27, 2),
(131, 26, 5);

 * sqlite:///sales.db
Done.

[]

## Pre-Processing Data

In [11]:
%%sql

--Customers
SELECT * FROM Customers LIMIT 10;

 * sqlite:///sales.db
Done.

[(1, 'John Smith', 'M', 28, 'New York'),
 (2, 'Emma Johnson', 'F', 34, 'Los Angeles'),
 (3, 'Michael Brown', 'M', 22, 'Chicago'),
 (4, 'Olivia Davis', 'F', 45, 'Houston'),
 (5, 'William Wilson', 'M', None, 'Phoenix'),
 (6, 'Sophia Martinez', 'F', 29, None),
 (7, 'James Anderson', 'M', 31, 'Philadelphia'),
 (8, 'Isabella Thomas', 'F', 27, 'San Antonio'),
 (9, 'Benjamin Jackson', 'M', 40, 'San Diego'),
 (10, 'Mia White', 'F', 35, 'Dallas')]

In [24]:
%%sql

--Products
SELECT * FROM Products
--LIMIT 10;

 * sqlite:///sales.db
Done.

[(1, 'Laptop Dell XPS', 'Electronics', 1200.0),
 (2, 'Smartphone iPhone', 'Electronics', 999.0),
 (3, 'Bluetooth Headphones', 'Electronics', 150.0),
 (4, 'Office Chair', 'Furniture', 300.0),
 (5, 'LED Desk Lamp', 'Furniture', 45.0),
 (6, 'Coffee Maker', 'Appliances', 80.0),
 (7, 'Electric Kettle', 'Appliances', 35.0),
 (8, 'Smartwatch Samsung', 'Electronics', 200.0),
 (9, 'Yoga Mat', 'Sports', 25.0),
 (10, 'Mountain Bike', 'Sports', 700.0),
 (11, 'Tennis Racket', 'Sports', 120.0),
 (12, 'Water Bottle', 'Sports', 10.0),
 (13, 'Cookware Set', 'Kitchen', 150.0),
 (14, 'Knife Set', 'Kitchen', 90.0),
 (15, 'Microwave Oven', 'Appliances', 250.0),
 (16, 'Vacuum Cleaner', 'Appliances', 180.0),
 (17, 'Dining Table', 'Furniture', 600.0),
 (18, 'Bookshelf', 'Furniture', 120.0),
 (19, 'Gaming Console', 'Electronics', 400.0),
 (20, 'USB Flash Drive 64GB', 'Electronics', 20.0),
 (21, 'Wireless Mouse', 'Electronics', 25.0),
 (22, 'Keyboard Mechanical', 'Electronics', 75.0),
 (23, 'Refrigerator', 'Appliances', 500.0),
 (24, 'Dishwasher', 'Appliances', 550.0),
 (25, 'Air Conditioner', 'Appliances', 350.0),
 (26, 'Hair Dryer', 'Appliances', 40.0),
 (27, 'Running Shoes', 'Sports', 85.0),
 (28, 'Smart TV', 'Electronics', 900.0),
 (29, 'Tablet iPad', 'Electronics', 400.0),
 (30, 'Knife', 'Kitchen', 25.0),
 (31, 'Airpods', 'Electronics', 200.0),
 (32, 'Blender', 'Kitchen', 60.0)]

In [13]:
%%sql

--Orders
SELECT * FROM Orders LIMIT 10;

 * sqlite:///sales.db
Done.

[(1, 1, '2024-02-15'),
 (2, 2, '2024-02-18'),
 (3, 3, '2024-03-10'),
 (4, 4, '2024-01-20'),
 (5, 5, None),
 (6, 6, '2024-05-12'),
 (7, 7, 'invalid-date'),
 (8, 8, '2024-06-02'),
 (9, 9, '2024-04-15'),
 (10, 10, '2024-03-22')]

In [14]:
%%sql

--OrderDetails
SELECT * FROM OrderDetails LIMIT 10;

 * sqlite:///sales.db
Done.

[(1, 1, 1, 1),
 (2, 1, 3, 2),
 (3, 2, 5, 1),
 (4, 2, 6, 1),
 (5, 3, 2, 1),
 (6, 3, 10, 1),
 (7, 4, 4, 2),
 (8, 5, 7, 6),
 (9, 6, 8, 3),
 (10, 7, 9, 1)]

In [15]:
%%sql

-- Customers with no city or age
SELECT * FROM Customers WHERE city IS NULL OR age IS NULL;

 * sqlite:///sales.db
Done.

[(5, 'William Wilson', 'M', None, 'Phoenix'),
 (6, 'Sophia Martinez', 'F', 29, None),
 (17, 'Matthew Clark', 'M', None, None),
 (23, 'Lily Potter', 'F', None, 'Phoenix'),
 (25, 'Frank Diaz', 'M', None, 'Phoenix'),
 (29, 'Stephen Salvatore', 'M', None, 'Virginia'),
 (30, 'Damon Salvatore', 'M', None, 'Virginia'),
 (31, 'Elena Gilbert', 'F', None, 'Virginia'),
 (32, 'Caroline Forbes', 'F', None, 'Virginia')]

In [16]:
%%sql

-- Orders with no or unvalid order_date 
SELECT * FROM Orders WHERE order_date IS NULL OR order_date NOT LIKE '____-__-__';

 * sqlite:///sales.db
Done.

[(5, 5, None),
 (7, 7, 'invalid-date'),
 (31, 11, None),
 (37, 17, 'invalid-date'),
 (53, 13, None),
 (55, 15, 'invalid-date')]

In [17]:
%%sql

-- Products with no price or negative price
SELECT * FROM Products WHERE price <= 0;

 * sqlite:///sales.db
Done.

[(23, 'Refrigerator', 'Appliances', 0.0),
 (24, 'Dishwasher', 'Appliances', -150.0)]

### Data Cleaning

##### Delete orders with no order_date : analysis is not possible without a date

In [18]:
%%sql

DELETE FROM Orders
WHERE order_date IS NULL
   OR order_date NOT LIKE '____-__-__';

 * sqlite:///sales.db
6 rows affected.

[]

##### Update customers with null city with 'Unknown'

In [19]:
%%sql

UPDATE Customers
SET city = 'Unknown'
WHERE city IS NULL;

 * sqlite:///sales.db
2 rows affected.

[]

##### Update customers age with null with average age

In [20]:
%%sql

SELECT AVG(age) FROM Customers WHERE age IS NOT NULL;

UPDATE Customers
SET age = 34
WHERE age IS NULL;

 * sqlite:///sales.db
Done.
8 rows affected.

[]

##### Add prices manually for products with null or negative

In [21]:
%%sql

UPDATE Products
SET price =  500
WHERE product_name = 'Refrigerator';

UPDATE Products
SET price = 550
WHERE product_name = 'Dishwasher';

 * sqlite:///sales.db
1 rows affected.
1 rows affected.

[]

#### Delete orders with no order details

In [22]:
%%sql

DELETE FROM Orders
WHERE order_id NOT IN (
    SELECT DISTINCT order_id FROM OrderDetails
);

 * sqlite:///sales.db
10 rows affected.

[]

## Save data as csv

In [23]:
import sqlite3
import pandas as pd

# Connect to database
conn = sqlite3.connect("sales.db")

# Tables list
tables = ['Customers', 'Products', 'Orders', 'OrderDetails']

# Convert to csv
for table in tables:
    df = pd.read_sql_query(f"SELECT * FROM {table}", conn)
    df.to_csv(f"{table}.csv", index=False)

conn.close()